Revit 2025 API
LightDistributionStyle Enumeration
 Tags for specific light distribution styles
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum LightDistributionStyle
Public Enumeration LightDistributionStyle
public enum class LightDistributionStyle
type LightDistributionStyle
Members
Member name | Value | Description
Spherical | 0 |  Spherical light distribution.
Hemispherical | 1 |  Hemispherical light distribution.
Spot | 2 |  Spot light distribution.
PhotometricWeb | 3 |  Photometric web (IES) light distribution.
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace